package com.test.stringOperation;

public class StringUtil {

    /*
    ↑↓←→↖↗↙↘↕

    常用上标 ⁰ ¹ ² ³ ⁴ ⁵ ⁶ ⁷ ⁸ ⁹ ⁺ ⁻ ⁼ ⁽ ⁾ ⁿ º ˙

    常用下标₀ ₁ ₂ ₃ ₄ ₅ ₆ ₇ ₈ ₉ ₊ ₋ ₌ ₍ ₎ ₐ ₑ ₒ ₓ ₔ ₕ ₖ ₗ ₘ ₙ ₚ ₛ ₜ

a: ₐ
b: ᵦ
c: ₓ (通常没有专用的下标 c)
d: ᵨ (通常没有专用的下标 d)
e: ₑ
f: ᶠ (通常没有专用的下标 f)
g: ᵧ (通常没有专用的下标 g)
h: ₕ
i: ᵢ
j: ⱼ
k: ₖ
l: ₗ
m: ₘ
n: ₙ
o: ₒ
p: ₚ
q: ᵩ (通常没有专用的下标 q)
r: ᵣ
s: ₛ
t: ₜ
u: ᵤ
v: ᵥ
w: ᵥ (通常没有专用的下标 w)
x: ₓ
y: ᵧ
z: ᶻ (通常没有专用的下标 z)

E = ½mv²

E = m(vₓ² + vᵧ²)

γ = 1/√(1-v²/c²)

     */

}
